app/controllers/drivers_controller.rb

  def dashboard
    @driver = Driver.find(session[:driver_id])
---
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = $1 LIMIT 1  [["id", 2]]