app/controllers/drivers_controller.rb

INSERT INTO "drivers" ("name", "email", "password_digest", "phone_number", "token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @driver = Driver.new(driver_params)
    if @driver.save

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."email" = $1 LIMIT 1  [["email", "d"]]
---
  def login
    @driver = Driver.find_by_email(driver_params[:email])

UPDATE "drivers" SET "token" = $1, "updated_at" = $2 WHERE "drivers"."id" = $3  [["token", "8ab33e80-35c8-421f-82e7-31101000dc35"], ["updated_at", "2015-09-15 16:32:13.071541"], ["id", 2]]
---
  def update
    @driver = current_driver
    @driver.update(driver_params)

UPDATE "drivers" SET "active" = $1, "token" = $2, "updated_at" = $3 WHERE "drivers"."id" = $4  [["active", "t"], ["token", "667e6819-3588-480e-99a5-faf7a15d523a"], ["updated_at", "2015-09-14 04:26:13.353474"], ["id", 2]]
---
  def activate
    @driver = current_driver
    @driver.update(driver_params)