app/controllers/locations_controller.rb

  def set_passenger_location
    @passenger = current_passenger
    if @passenger.location.nil?
      @passenger.create_location(location_params)
    else
      @passenger.location.update_attributes(location_params)
---
INSERT INTO "locations" ("lat", "lng", "locatable_id", "locatable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["lat", "37.8627467"], ["lng", "-122.2759713"], ["locatable_id", 7], ["locatable_type", "Passenger"], ["created_at", "2015-09-11 16:09:09.425158"], ["updated_at", "2015-09-11 16:09:09.425158"]]
UPDATE "locations" SET "locatable_id" = $1, "updated_at" = $2 WHERE "locations"."id" = $3  [["locatable_id", nil], ["updated_at", "2015-09-11 15:43:31.043331"], ["id", 2]]