app/controllers/passengers_controller.rb

INSERT INTO "passengers" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["email", ""], ["password", ""], ["created_at", "2015-04-21 22:35:39.555402"], ["updated_at", "2015-04-21 22:35:39.555402"]]
---
  def create
    @passenger = Passenger.new(passenger_params)
    if @passenger.save

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."email" = $1 LIMIT 1  [["email", "a"]]
---
  def login
    @passenger = Passenger.find_by_email(passenger_params[:email])