app/controllers/trips_controller.rb

  def index
    p "=================================================="
    p current_driver
    p request.headers["email"]
    @driver = current_driver
    trips = Trip.where(driver_id: @driver.id, accepted: nil)
---
SELECT "trips".* FROM "trips" WHERE "trips"."driver_id" = $1 AND "trips"."accepted" IS NULL  [["driver_id", 2]]

  def create
    p "--------------------------------------------"
    p params
    @passenger = current_passenger
    @trip = @passenger.trips.new(trip_params)
      if @trip.save
---
INSERT INTO "trips" ("driver_id", "passenger_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["driver_id", 7], ["passenger_id", 7], ["created_at", "2015-09-15 15:21:18.820349"], ["updated_at", "2015-09-15 15:21:18.820349"]]

  def update
    @trip = Trip.find(params[:id])
    @trip.update_attributes(trip_params)
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "trips" SET "accepted" = $1, "updated_at" = $2 WHERE "trips"."id" = $3  [["accepted", "t"], ["updated_at", "2015-09-15 21:58:08.463525"], ["id", 5]]